<template>
	<div class="register-container clearfix">
		<div class="register-wrapper">
			<h2 class="registe-title">用户注册</h2>
			<div class="step-group clearfix">
				<div class="step-item step-item1 step-active"><span class="num">1</span></div>
				<div class="step-item step-item2"><span class="num">2</span></div>
				<div class="step-item step-item3"><span class="num">3</span></div>
				<div class="step-item step-item4"><span class="num">4</span></div>
			</div>
			<div class="step1">
				<div class="step1-content">
					<h3 style="text-align: center;">未度ERP平台服务协议</h3>
					<p>感谢您选择未度ERP平台服务（以下简称“本服务、未度平台、平台”）。未度平台是由上海极盟网络科技有限公司（以下简称“极盟网络”）开发并经营，在您使用未度平台前，您应当仔细阅读并遵守《未度平台服务协议》（以下简称“本协议”）以及未度平台规则。本协议由您与未度平台的经营者共同缔结，本协议具有合同效力。<b>请您务必审慎阅读、充分理解该等协议、规则各条款内容，特别是限制或免除责任的相应条款、争议解决和法律适用条款。限制或免除责任条款可能将以加粗字体形式显示，提示您注意，您应重点阅读。</b></p>
					<p>除非您已阅读并接受本协议以及未度平台规则的所有条款,否则您无权使用本服务的任何部分或全部。您对本服务的任何使用行为,包括但不限于注册、登录本服务均视为您已阅读并同意受本协议及未度平台规则全部条款的约束,届时您不应以未阅读本协议或未度平台规则的内容或者未获得未度对您问询的解答等理由,主张本协议无效,或要求撤销本协议。如果您不同意未度平台规则的约定,您应立即停止注册或停止使用未度平台服务。如您对本协议有任何疑问,应根据本协议列明的联系方式联系未度。</p>
					<h3>一、 定义</h3>
					<p>1. <b>未度:</b>是指未度移动智能终端设备客户端（未度APP）、未度网站(corefac.com)。</p>
					<p>2. <b>未度ERP平台服务:</b>未度基于互联网,在未度网站、移动智能终端设备客户端向您提供的各项服务,包括但不限于创建健身房、健身房管理、教练管理、课程管理、账户管理等具体服务。本服务包含的具体服务以未度提供的服务内容为准。</p>
					<p>3. <b>未度用户:</b>指在未度移动智能终端设备客户端浏览或预约课程/服务的用户。</p>
					<p>4. <b>未度商家:</b>指成功注册未度系统,在未度APP上创建健身房并提供预约/服务的用户。</p>
					<p>5. <b>未度平台规则:</b>为《未度ERP平台服务协议》、《未度APP用户注册服务协议》等未度已经发布的及将来可能发布的各类相关协议、相关业务规则、解读、公告的统称。所有规则为本协议不可分割的组成部分,与本协议正文具有同等法律效力。</p>
					<h3>二、 本协议及/或本服务的变更</h3>
					<p>1. 未度有权根据需要不时地依照本协议约定方式就本协议的有关约定和/或本服务内容进行变更。一旦本协议和/或本服务内容发生变更,未度将会在该变更内容确定后,以未度客户端更新的方式向用户公布,您知悉并认可未度无需另行单独通知您。</p>
					<p><b>2. 您应不时关注本协议及本服务有关内容,以便掌握任何变动情况。如果您不同意未度变更的内容,您应主动停止使用本服务。如果您在变更内容通告后7天内未主动停止使用本服务,则视为您接受本协议和/或本服务的变更,变更内容通告后您如果仍继续使用本服务亦构成您对有关变更内容的接受与认可。如您针对变更内容有异议,您应立即停止使用全部本服务,且您应在上述约定期限内主动停止使用本服务。</b></p>
					<p>3. 同时,未度将可能进一步扩充本服务功能(扩充的服务功能纳入本服务范畴,本协议同样适用于扩充的服务功能),针对该部分新增功能将有可能附带特别适用于该功能的协议内容,请您在使用该新增功能前,仔细阅读该功能所附带协议(如有)。届时您接受该项新增功能服务的前提为您同意该项新增功能服务所附带的所有法律文档,包括但不限于本协议及新增功能服务所附带的协议。如果您不接受该新增功能所附带协议,请切勿使用该新增功能,否则您的使用行为将被视为您对附带协议的完全接受。同时您知悉并同意如本协议与任何针对某项新增服务添加相关特别约定、协议不一致的,均优先适用针对新增功能所添加相关特别约定及协议的规定。
					</p>
					<h3>三、 账户注册与使用</h3>
					<p>1. 主体资格</p>
					<p>您确认,在您注册或以其他未度允许的方式实际使用未度平台服务时,您应当是<b>具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织</b>。若自然人用户不具备前述主体资格,则您及您的监护人应承担因此而导致的一切后果,且未度有权注销或永久冻结您的账户,并向您及您的监护人索偿相应损失。</p>
					<p>2. 注册与使用</p>
					<p>a)当您按照注册页面提示填写手机号、阅读并同意本协议且收到未度发送的短信验证码后,由您填写验证码,完成全部注册程序后,或您以其他未度允许的方式实际使用未度平台服务时,您即受本协议约束。您可以使用您提供或确认的手机号码或者未度允许的其它方式作为登录手段进入未度平台。</p>
					<p>b)您知悉并同意,如您在未度平台注册成功,您即可以获得未度账号。您在此明确授权,您的账户注册信息在通过未度注册成功时,已授权未度披露给未度APP使用,以使您更便捷的使用本服务。</p>
					<p>c)您的登录名和密码不得以任何方式买卖、转让、赠与或继承,除非有法律明确规定或司法裁定,并经未度同意,且需提供未度要求的合格的文件材料并根据未度制定的操作流程办理。</p>
					<p>d)在注册或激活流程时,您应当依照法律法规要求,按相应页面的提示准确提供您的资料,并于资料信息变更时及时更新,以保证您所提交资料的真实、及时、完整和准确。如有合理理由怀疑您提供的资料错误、不实、过时或不完整的,未度有权向您发出问询及/或要求及时更正的通知,并有权直接做出删除相应资料的处理,甚至中止、终止对您提供部分或全部未度ERP平台服务。未度对此不承担任何责任,由您自行承担因此产生的全部直接或间接损失及不利后果。
						<p>e)您应当准确填写并及时更新您提供的联系电话等联系方式,以便未度或其他 用户与您取得联系,因通过这些联系方式无法与您取得联系,导致您在使用本服务过程中产生任何损失或承担任何法律责任的,应由您完全独自承担。您了解并同意,您有义务保证你提供的联系方式的真实性和有效性,如有变更的,您应按未度的要求进行操作。
							<p>3. 账户安全
								<p><b>您应妥善保管您的账号和密码。因您保管不善而可能导致账号或密码失窃的,责任由您自行承担。</b>且您须对在该登录名下发生的所有活动(包括但不限于信息披露、发布信息、网上点击同意或提交各类规则协议、网上续签协议或购买服务等)承担责任。</p>
								<p>您知悉并认可:
									<p>a)如发现任何账户安全问题,您应立即采取有效方式通知未度,并授权未度将该信息同步给口袋平台;您认可未度对您的任何请求采取行动均需要合理的时间,除未度存在过错外,未度对在采取行动前已经产生的后果不承担任何责任。</p>
									<p>b)为确保您在每个上网时段结束时,以正确步骤离开网站、移动智能终端设备应用、服务。您理解并同意给予未度合理的时间对您提出请求做出相应的处理及提供解决方案,未度对在未度采取行动前已经产生的任何后果(包括但不限于您遭受的任何损失及/或承担的责任)不承担任何法律责任。</p>
									<h3>四、 用户个人隐私信息的保护</h3>
									<p>1. 未度深知您珍视个人隐私,并理解保护您个人信息的重要性。未度将按照相关法律法规的规定收集、使用、保存和分享您的个人信息。为了改善产品服务,让您得到更好的用户体验,未度可能会与第三方服务供应商以及其他合作伙伴进行合作向您提供未度服务,并有可能需要使用您的个人信息。未度将努力确保第三方服务供应商以及其他合作伙伴采取的保密和安全措施不低于未度对您个人隐私信息保护的措施,如您不同意未度收集、使用、保存和分享您的个人信息,您应立即停止使用本服务。</p>
									<p>2. 未度将按照本协议以及《未度APP注册服务协议》的规定收集、使用、保存和分享您的个人信息。本协议对个人信息保护规定的内容与上述《未度APP注册服务协议》有冲突的,及本协议对个人信息保护相关内容未作明确规定的,均应以《未度APP注册服务协议》内容为准。</p>
									<p>3. 您在注册账号和使用本服务的过程中,根据法律法规要求需要填写一些必要的用户个人信息。您应当保证填写的身份信息为真实、完整的。您知悉并认可,若您填写的信息不完整,则无法使用本服务或在使用过程中受到限制。</p>
									<p>4. 一般情况下,您可随时浏览、修改自己提交的相关信息,但出于安全性和身份识别的考虑,您可能无法自行修改注册时提供的手机号码。如有任何问题欢迎与未度客服取得联系(联系方式请见本协议)。</p>
									<p>5. 未度将应用各种安全技术和程序建立完善的管理制度来保护您的个人信息以免遭受未经授权的访问、使用或披露。</p>
									<p>6. 未度非经您的许可或根据相关法律、法规的强制性规定,不会透露您的个人信息。如您涉嫌侵犯他人知识产权等合法权益,则经未度初步审核确有涉嫌侵权行为存在的情况下,未度有权向权利人提供您的相关个人信息。未度承诺并保证这些信息仅且仅用于核实未度的记录并向用户提供更适合需要的服务。</p>
									<p>7. 未度不会将您的个人信息转移或披露给任何非关联的第三方,除非:</p>
									<p>a)相关法律法规或法院、政府机关要求;
										<p>b)为完成合并、分立、收购或资产转让而转移;
											<p>c)为提供给您要求的服务所必需。
												<p>8. 未度非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人,在使用本服务前,应事先取得您家长或法定监护人的书面同意。</p>
												<p>9. 您声明并保证,您对您所发布的信息拥有相应、合法的权利。否则,未度可对您发布的信息依法或依本协议进行删除或屏蔽。</p>
												<h3>五、预约及/或服务</h3>
												<p>您的预约及/或服务行为应当基于真实的用户消费需求,不得存在对预约及/或服务实施恶意销售、恶意维权等扰乱未度平台正常运营秩序的行为。基于维护未度平台运营秩序及安全的需要,未度发现上述情形时可主动执行关闭相关预约及/或服务等操作。</p>
												<h3>六、本服务使用规范</h3>
												<p>1. 您承诺在使用本服务过程中,您应遵守以下约定:</p>
												<p><b>a)实施的所有行为均应遵守国家法律、法规等规范性文件及未度平台各项规则的规定和要求,不违背社会公共利益或公共道德,不损害他人的合法权益,不违反本协议及相关规则。您如果违反前述承诺,产生任何法律后果的,您应以自己的名义独立承担所有的法律责任,并确保未度平台免于因此产生任何损失。</b></p>
												<p><b>b)不以虚构或歪曲事实的方式贬低、诋毁其他用户,不采取不正当方式提升或试图提升自身的信用度。</b></p>
												<p><b>c)未经未度书面许可,不得自行或允许第三方以任何形式抓取未度的数据,不对未度平台上的任何数据作商业性利用,包括但不限于在未经未度事先书面同意的情况下,以复制、传播等任何方式使用未度平台上展示的资料。</b></p>
												<p><b>d)不使用任何装置、软件或例行程序干预或试图干预未度平台的正常运作或正在未度平台上进行的任何活动。您不得采取任何将导致不合理的庞大数据负载加诸未度平台网络设备的行动。</b></p>
												<p><b>e)您的未度服务信息,可通过微信朋友圈、新浪微博、等进行转发,但因您转发内容导致的任何纠纷均由您自行承担。</b></p>
												<p><b>f)您承诺在使用未度平台时应遵守中华人民共和国相关法律法规及未度平台规则等,不得从事任何非法交易或违反未度平台相关规则的交易行为,出现违约的,按照本协议承担违约责任。</b></p>
												<p><b>2.您有权自行决定服务及/或服务的促销及推广方式,未度亦为您提供了丰富的推广方式,您承诺您的推广行为应当符合国家相关法律法规及未度平台规则的规定。</b></p>
												<p>3.您了解并同意:</p>
												<p><b>a)您如果违反前述承诺,产生任何法律后果的,您应以自己的名义独立承担所有的法律责任,并确保未度平台免于因此遭受任何损失或承担任何责任。</b></p>
												<p><b>b)基于维护未度平台交易秩序及交易安全的需要,未度有权在发生诈骗、售假等扰乱市场正常秩序的情形下,对相关健身房执行关闭等操作。</b></p>
												<p><b>c)经国家行政或司法机关的生效法律文书确认您存在违法或侵权行为,或者未度根据自身的判断,认为您的行为涉嫌违反法律法规的规定或涉嫌违反本协议和/或未度规则的条款的,未度有权不经通知您即予以删除,且按照相关规则的规定对您进行处罚。未度有权在未度平台上公示您的该等涉嫌违法或违约行为及未度已对您采取的措施。</b></p>
												<p><b>d)对于您违反本协议项下承诺,或您在未度平台上实施的行为,包括您未在未度平台上实施但已经对未度平台及其用户产生影响的行为,未度有权单方认定您行为的性质及是否构成对本协议及/或未度规则的违反,并根据单方认定结果适用规则予以处理或终止向您提供服务,且无须征得您的同意或提前通知您。您应自行保存与您行为有关的全部证据,并应对无法提供充要证据而承担的不利后果。</b></p>
												<p><b>e)如您涉嫌违反有关法律或者本协议之规定,使未度遭受任何损失,或导致任何第三方对未度提起索赔,或使未度遭受任何行政管理部门的处罚,您应当赔偿未度因此产生的全部损失及或发生的费用,包括但不限于诉讼费、律师费以及未度向第三方支付的赔偿金或违约金等。</b></p>

												<h3>七、特别授权</h3>
												<p><b>1. 您知悉并认可,您对本服务的实际使用行为,即视为同意未度客户端向您发送相关信息。</b></p>
												<p>2. 一旦您向未度和/或其关联公司作出任何形式的承诺,且相关方已确认您违反了该承诺,则未度有权立即按您的承诺或协议约定的方式对您的账号采取限制措施,包括中止或终止向您提供服务,并公示相关方确认的您的违约情况。您了解并同意,未度无须就相关确认与您核对事实,或另行征得您的同意,且未度无须就此限制措施或公示行为向您承担任何的责任。</p>
												<p>3. 一旦您违反本协议,或与未度签订的其他协议的约定,未度有权以任何方式通知未度关联公司,要求其对您的权益采取限制措施,包括但不限于将您账号内的预约/服务下架、封号等</p>
												<p>4. 对于您提供的资料及数据信息,您授予未度平台及其关联公司独家的、全球通用的、永久的、免费的许可使用权利(并有权在多个层面对该权利进行再授权)。此外,未度及其关联公司有权(全部或部分地)使用、复制、修订、改写、发布、翻译、分发、执行和展示您的全部资料数据(包括但不限于注册资料、教练信息及全部展示于未度平台的各类信息)或制作其派生作品,并以现在已知或日后开发的任何形式、媒体或技术,将上述信息纳入其它作品内。</p>
												<p>5. 为方便您使用本服务,您同意并授权未度将您在账户注册/激活、使用未度平台服务过程中提供、形成的信息传递给向您提供服务的组织或其他组织,或从提供未度平台或其他组织获取您在注册/激活、使用其他服务期间提供、形成的信息。您同意不会因此追究极盟网络及其关联公司及其旗下所有平台的责任。</p>
												<h3>八、免责声明及有限保证</h3>
												<p><b>1. 未度负责按"现状"和"可得到"的状态向您提供未度平台服务。未度对本服务的适用性、完整性、持续性、准确性、可靠性以及满足用户的要求或符合用户的期望等不作任何担保,不论是明示的或默示的。同时,未度也不对本服务所涉及的技术及信息的有效性、准确性、正确性、可靠性、质量、稳定性、完整性和及时性作出任何承诺和保证。</b></p>
												<p><b>2. 您了解未度仅向您提供未度平台服务,且未度平台上的的信息均系用户自行发布,可能存在风险和瑕疵。未度平台仅作为第三方展示平台。未度平台仅作为您获取信息或服务信息、物色服务对象、就服务的交易进行协商及开展查询和预约的场所,但未度无法控制交易所涉及的服务的质量、安全或合法性,以及交易各方履行其在交易协议中各项义务的能力。因此,未度不对用户行为的合法性、有效性、真实性作任何明示或默示的担保,对此您应谨慎判断。</b></p>
												<p><b>3.除非法律法规明确要求,或出现以下情况,否则,未度没有义务对所有用户的信息数据、商品和服务信息、交易行为以及与交易有关的其它事项进行审查:</b></p>
												<p><b>a)未度有合理的理由认为特定用户及具体交易事项可能存在重大违法或违约情形。</b></p>
												<p><b>b)未度有合理的理由认为用户在未度平台的行为涉嫌违法或不当。</b></p>
												<p><b>4. 您理解并同意,未度并非司法机构,仅能以普通人的身份对证据进行鉴别,未度对争议的调处完全是基于您不可撤销得授权,其无法保证争议处理结果符合您的期望,也不对争议调处结论承担任何责任。如您因此遭受任何损失或承担任何法责任,均与未度无关。</b></p>
												<p><b>5. 尽管本协议中可能含有相反的规定,在适用法律允许的最大范围内,您了解并同意,未度不对因您使用本服务引起的、或在任何方面与本服务有关的任何意外的、非直接的、特殊的利益损失承担责任,包括但不限于利润、商誉、使用、数据等方面的损失或其它无形的损失,(无论未度是否已被告知该等损害赔偿的可能性)。</b></p>
												<p><b>7. 不论在何种情况下,未度均不对由于信息网络正常的设备维护,信息网络连接故障,电脑、通讯或其他系统的故障,电力故障,罢工,劳动争议,暴乱,起义,骚乱,生产力或生产资料不足,火灾,洪水,风暴,爆炸,战争,政府行为,司法行政机关的命令或第三方的不作为而造成的不能服务或延迟服务承担责任。</b></p>
												<h3>九、知识产权归属</h3>
												<p>1. 未度所包含的全部智力成果包括但不限于数据库、网站设计、文字和图表、软件、照片、录像、音乐、声音及其前述组合,软件编译、相关源代码和软件(包括小应用程序和脚本)的知识产权权利均归极盟网络所有。用户不得为商业目的复制、更改、拷贝、发送或使用前述任何材料或内容。</p>
												<p>2. 未度名称中包含的所有权利,包括但不限于著作权、商标权等,均归极盟网络所有。</p>
												<p>3. 用户在使用未度服务过程中不得未经权利人的合法授权使用未度或他人的合法知识产权权利。</p>
												<h3>十、侵权处理</h3>
												<p>如您认为未度平台商家发布的信息侵犯了您的合法权利,您有权向未度提交书面权利通知书,要求未度删除相关涉嫌侵权的商品。权利通知书应包含的具体内容以及邮寄地址,请您根据本协议列明的客服热线联系未度客服。</p>
												<h3>十一、客户服务</h3>
												<p>1. 未度建立专业的客服团队,并建立完善的客户服务制度,从技术、人员和制度上保障用户提问及投诉渠道的畅通,为用户提供及时的疑难解答与投诉反馈服务。</p>
												<p><b>2. 客户热线: 021-56389735 (工作时间:周一至周五,早九点半至晚六点半)。</b></p>
												<p><b>3. 客服电子邮箱:service@corefac.com。</b></p>
												<p>4. 在线反馈:登录未度客户端,点击“个人”选择“设置”图标,点击“反馈”。</p>
												<h3>十二、违约赔偿</h3>
												<p>如由于您使用本服务、违反本协议及其他相关协议、或您侵害他人合法权益而使未度及其关联公司遭受任何损失(包括但不限于律师费、诉讼费),或导致任何第三人向未度及其关联公司提出任何索赔或请求,或导致未度及其关联公司遭受任何行政管理部门的处罚,您应使未度及其关联公司不因此遭受任何损害,并保证承担由此引发的全部法律责任。</p>
												<h3>十三、协议的中止与终止</h3>
												<p>1. 您知悉并认可,未度有权自行决定以合理的理由、在法律允许的最大范围内,并不经事先通知的中止、终止向您提供部分或全部未度平台服务,暂时冻结或永久冻结(注销)您的账号在未度平台的权限,且无须为此向您或任何第三方承担任何责任。</p>
												<p>2. 出现以下任一情况时,未度有权直接以注销账号的方式终止本协议,并有权永久冻结(注销)您的未度账号的权限:</p>
												<p>a)未度终止向您提供服务后,您涉嫌再一次直接或间接以他人名义注册为未度用户的;</p>
												<p>b)您的账户名称、头像或简介涉嫌违反法律法规、包含不良信息、涉嫌冒用或关联机构或社会名人注册账户名称的;</p>
												<p>c)严重侵犯未度用户的合法权益、不履行法律规定的相关义务;</p>
												<p>d)严重违反未度平台规则;</p>
												<p>e)本协议(含规则)变更时,您明示并通知未度不愿接受新的服务协议的;</p>
												<p>f)其它未度认为应当终止服务的情况。 </p>
												<p>3. 您的账号服务被终止或者账号在未度平台的权限被永久冻结(注销)后,未度没有义务为您保留或向您披露您账号中的任何信息,也没有义务向您或第三方转发任何您未曾阅读或发送过的信息。</p>
				</div>
			</div>
			<div class="reg-btn-group">
					<div class="checkbox-wrapper">
						<el-checkbox v-model="checked" class="remember">我已阅读</el-checkbox>
					</div>
					<div v-if="checked == true">
						<el-button type="primary" @click.native="handleNextStep" style="width: 200px;">我已阅读服务协议，下一步</el-button>
					</div>
					<div v-else>
						<el-button type="primary" @click.native="handleNextStep" style="width: 200px;" disabled="disabled">我已阅读服务协议，下一步</el-button>
					</div>
			</div>
		</div>
	</div>
</template>
<script type="text/javascript">
	import AXIOS from '../../axios/axios'
	import global_ from '../../common/js/common'
	import valid from '../../common/js/validate'
	import '../../common/js/sha512.js'
	const Axios = new AXIOS();
	export default {
		name: 'step1',
		data(){
			return {
				path: global_.path,
		      	disabled:true,
		      	checked:false,
			}
		},
		methods:{
			handleNextStep(){
				this.$router.push('/step2');
			}
		}
	}
</script>
<style>
	h3 {
		margin: 20px 0;
	}
	
	.checkbox-wrapper {
		margin: 30px auto;
	}
	
	.register-wrapper .el-checkbox {
		color: #FFFFFF;
	}

</style>